print("variables - переменные")

# 1. Назначенные переменные
#
a = 5
b = 15
c = 35

print("Имеющиеся переменные:" a, b, c)
#
# 2. Запрашиваемые данные(цифры) для переменных
#
# a = int(input("Введите первое значение"))
# b = int(input("Введите второе значение"))
# c = int(input("Введите третье значение"))
#
# print("Вы ввели числа:", a, b, c)
#
# 3. Запрашиваемые данные(строки) для переменных
#
# a = input("Введите вашу фамилию")
# b = input("Введите ваше имя")
# c = input("Введите город вашего проживания")
#
# print("Вы,", b, a, ", проживаете в городе", c)
#
# 4. Запрашиваемые данные для переменных
#
# surname = input("Укажите вашу фамилию")
# name = input("Как вас зовут?")
# age = int(input("Сколько вам лет?"))
# location = input("В каком городе проживаете?")
# des_location = input("Где хотели бы жить")
#
# print(name, surname, ", которому", age, "лет, живёт в городе", location, ", а хотелось бы в городе", des_location)
#
